import type { FieldFeature } from '../domain/models';

export const FIELDS: readonly FieldFeature[] = [
  {
    type: 'Feature',
    properties: {
      id: 'field-1',
      name: 'Поле №1 - Пшениця',
      area: 411.4,
      crop: 'Пшениця',
    },
    geometry: {
      type: 'Polygon',
      coordinates: [
        [
          [31.031403, 50.268372],
          [31.039914, 50.279293],
          [31.068076, 50.273052],
          [31.050028, 50.253317],
          [31.042325, 50.255913],
          [31.037275, 50.261604],
          [31.031403, 50.268372],
        ],
      ],
    },
  },

  {
    type: 'Feature',
    properties: {
      id: 'field-2',
      name: 'Поле №2 - Соняшник',
      area: 86.9,
      crop: 'Соняшник',
    },
    geometry: {
      type: 'Polygon',
      coordinates: [
        [
          [31.030859, 50.268013],
          [31.023759, 50.273466],
          [31.029712, 50.281457],
          [31.039570, 50.279239],
          [31.030859, 50.268013],
        ],
      ],
    },
  },

  {
    type: 'Feature',
    properties: {
      id: 'field-3',
      name: 'Поле №3 - Кукурудза',
      area: 206.2,
      crop: 'Кукурудза',
    },
    geometry: {
      type: 'Polygon',
      coordinates: [
        [
          [31.058267, 50.262107],
          [31.068963, 50.273103],
          [31.074918, 50.271482],
          [31.072492, 50.267887],
          [31.087599, 50.263094],
          [31.081755, 50.254564],
          [31.058267, 50.262107],
        ],
      ],
    },
  },

  {
    type: 'Feature',
    properties: {
      id: 'field-4',
      name: 'Поле №4 - Ріпак',
      area: 227.5,
      crop: 'Ріпак',
    },
    geometry: {
      type: 'Polygon',
      coordinates: [
        [
          [31.058267, 50.261755],
          [31.050878, 50.253013],
          [31.058081, 50.249696],
          [31.067720, 50.242837],
          [31.081567, 50.254123],
          [31.058267, 50.261755],
        ],
      ],
    },
  },
];